#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/renata-corporation/learning-aws-lambda-with-serverless/runs/run-WjKL7NpLrD5WibGJ

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_rest_api.MyDemoAPI: Refreshing state... [id=l9izdkmlve]
aws_api_gateway_resource.MyDemoResource: Refreshing state... [id=0jrp72]
aws_api_gateway_method.MyDemoMethod: Refreshing state... [id=agm-l9izdkmlve-0jrp72-GET]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "0jrp72"
      + rest_api_id             = "l9izdkmlve"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:execute-api:sa-east-1:251675404411:l9izdkmlve/*/GET/mydemoresource"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @renatabrasil, Action: `pull_request`*